In [154]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [155]:
df = pd.read_csv('Files/tn.movie_budgets.csv.gz')
df
#import csv as a read me file

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [156]:
df.isnull().sum()
#checking to see if there are any null values in the data set for data cleaning

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [157]:
df['production_budget'] = df['production_budget'].str.replace('$','')

df['domestic_gross'] = df['domestic_gross'].str.replace('$','')

df['worldwide_gross'] = df['worldwide_gross'].str.replace('$','')
#getting rid of the dollar signs for numbers to turn them into floats to be able to compare numbers

In [158]:
df['production_budget'] = df['production_budget'].str.replace(',','')

df['domestic_gross'] = df['domestic_gross'].str.replace(',','')

df['worldwide_gross'] = df['worldwide_gross'].str.replace(',','')
#getting rid of the commas for numbers to turn them into floats to be able to compare numbers

In [159]:
df.worldwide_gross = df.worldwide_gross.astype(float)
df.domestic_gross = df.domestic_gross.astype(float)
df.production_budget = df.production_budget.astype(float)
#turning all of the number based columns into floats after taking out the commas and dollar signs

In [160]:
df.info()
#checking to make sure that the columns were converted from objects to integers for further analysis

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 271.2+ KB

In [161]:
df.loc[df['worldwide_gross'] > df['production_budget'], 'Profitability'] = True
df.loc[df['worldwide_gross'] < df['production_budget'], 'Profitability'] = False
df.loc[df['worldwide_gross'] == df['production_budget'], 'Profitability'] = 'Broke Even'
#Creating a new column called profitability to see which movies made more than they spent by using inequality symbols
#Using true and false to easily see which movies were profitable

In [162]:
df['Profit ($)'] = df['worldwide_gross'] - df['production_budget']
#Creating a new column called profit ($) by subtracting the production_budget away from the worldwide gross to find net
#this column factualizes the profitability column

In [163]:
df = df.sort_values(['Profit ($)'], ascending=False)
#sorting the profit column so that the most profitable are at the top to analyse if that effects our business
#reccomendations

In [164]:
df['Profit (millions)'] = '$' + (df['Profit ($)'].astype(float)/1000000).astype(str) + 'MM'
#creating a column that is the Profit ($) colum, but in millions with dollar signs so its more readable

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Profitability,Profit ($),Profit (millions)
0,1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09,True,2.351345e+09,$2351.345279MM
42,43,"Dec 19, 1997",Titanic,200000000.0,659363944.0,2.208208e+09,True,2.008208e+09,$2008.208395MM
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000.0,678815482.0,2.048134e+09,True,1.748134e+09,$1748.1342MM
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000.0,936662225.0,2.053311e+09,True,1.747311e+09,$1747.31122MM
33,34,"Jun 12, 2015",Jurassic World,215000000.0,652270625.0,1.648855e+09,True,1.433855e+09,$1433.854864MM
...,...,...,...,...,...,...,...,...,...
352,53,"Apr 27, 2001",Town & Country,105000000.0,6712451.0,1.036477e+07,False,-9.463523e+07,$-94.635231MM
341,42,"Jun 14, 2019",Men in Black: International,110000000.0,3100000.0,3.100000e+06,False,-1.069000e+08,$-106.9MM
193,94,"Mar 11, 2011",Mars Needs Moms,150000000.0,21392758.0,3.954976e+07,False,-1.104502e+08,$-110.450242MM
194,95,"Dec 31, 2020",Moonfall,150000000.0,0.0,0.000000e+00,False,-1.500000e+08,$-150.0MM
2,3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08,False,-2.002376e+08,$-200.23765MM